system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.2 -0.2 -0.02)
    (3 -0.2 -0.02)
    (3 1.8 -0.02)
    (-0.2 1.8 -0.02)
    (-0.2 -0.2 1.2)
    (3 -0.2 1.2)
    (3 1.8 1.2)
    (-0.2 1.8 1.2)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    base
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
            (0 4 7 3)
            (1 5 6 2)
            
        );
    }
    back
    {
    	type patch;
    	faces
    	(
    	    (0 1 2 3)
    	);
    }
    front
    {
    	type patch;
    	faces
    	(
    	    (4 5 6 7)
    	);
    }
);


// ************************************************************************* //
