system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    inlet.stl{ type triSurfaceMesh; name inlet;}
    outlet.stl{ type triSurfaceMesh; name outlet;}
    sphere.stl{ type triSurfaceMesh; name sphere;}
    symmetry_1.stl{ type triSurfaceMesh; name symmetry_1;}
    symmetry_2.stl{ type triSurfaceMesh; name symmetry_2;}
}


castellatedMeshControls
{
    maxLocalCells 300000;
    maxGlobalCells 1500000;
    minRefinementCells 0;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 2;

    features
    (
        { file "hyperSphere.eMesh"; level 4;}
    );

    refinementSurfaces
    {
        inlet{level (3 3);}
        outlet{ level (4 4);}
        sphere{ level (8 8);}
        symmetry_1{ level (3 3);}
        symmetry_2{ level (3 3);}
    }

    resolveFeatureAngle 15;

    refinementRegions
    {
    }

    locationInMesh (1.52372 1.04857 0.40504);
    allowFreeStandingZoneFaces false;
}

snapControls
{
    nSmoothPatch 2;
    tolerance 3.0;
    nSolveIter 100;
    nRelaxIter 8;
    nFeatureSnapIter 20;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
}

addLayersControls
{
    relativeSizes true;

    layers
    {
        sphere
        {
            nSurfaceLayers 15;
        }
    }

    expansionRatio 1.1;
    finalLayerThickness 0.25;
    minThickness 0.05;
    nGrow 0;
    featureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality -1;
    minArea -1;
    minTwist 0.01;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
    relaxed
    {
        maxNonOrtho 75;
    }
}

mergeTolerance 1e-6;

